README_REPORT.md
```mermaid
classDiagram
    class Base { <<interface>> }
    class Product { +name: str \n +price_in_rub: float }
    class ExchangeRate { +currency_code: str \n +rate: float }
    class Collector { +run_cycle() }
    class Bot { +start() \n +find_products() \n +compare_prices() }
    class DatabaseManager { +get_session() }
    
    Base <|-- Product : наследует
    Base <|-- ExchangeRate : наследует

    Bot *-- DatabaseManager : композиция
    Collector *-- DatabaseManager : композиция

    Collector ..> ExchangeRate : использует
    Collector ..> Product : <<create/update>>
    Bot ..> Product : <<read>>
```
